old/app/views/projects/index.json.jbuilder

SELECT COUNT(*) FROM `issues` WHERE `issues`.`project_id` = 55
---
	json.name project.name
	json.issues_count project.issues.size