old/app/controllers/issues_controller.rb

INSERT INTO `issues` (`created_at`, `description`, `name`, `project_id`, `updated_at`) VALUES ('2014-02-15 14:01:01', 'asdfongfjs ', 'Issue 3', 55, '2014-02-15 14:01:01')
---
	def create
		@issue = Issue.new(issue_params)
		if !@issue.save