old/app/controllers/projects_controller.rb

SELECT `projects`.* FROM `projects`
---
	def index
		@projects = Project.all

INSERT INTO `projects` (`created_at`, `description`, `name`, `updated_at`) VALUES ('2014-02-14 20:09:59', '', 'Simon Fletcher', '2014-02-14 20:09:59')
---
	def create

		project = Project.new(project_params)
		project.save

SELECT `issues`.* FROM `issues` WHERE `issues`.`project_id` IN (55)
SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 1 LIMIT 1
---
	def show
		@project = Project.includes(:issues).find(params[:id])

DELETE FROM `projects` WHERE `projects`.`id` = 1
SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 1 LIMIT 1
---
	def destroy
		@project = Project.find(params[:id]).destroy()

UPDATE `projects` SET `name` = '234332tesitng', `description` = '1234r', `updated_at` = '2014-02-15 10:42:03' WHERE `projects`.`id` = 44
---
	def update
		@project.update_attributes(project_params)